public class Announcement {

    /////////////////////////// 메인 출력 포맷 //////////////////////////////
    public void mainAnnouncement(){
        System.out.println(
                        "┌-----------------------------------------------┐\n" +
                        "│\t\t\t\t배달왕 호반우가 간다!\t\t\t\t│\n" +
                        "│\t\t\t<경북대학교 제휴업체 배달 서비스>\t\t\t│\n" +
                        "│-----------------------------------------------│\n" +
                        "│\t\t혹시, 배달왕 호반우가 처음이신가요?\t\t\t│\n" +
                        "│\t\t1. 회원가입\t\t\t\t\t\t\t\t│\n" +
                        "│-----------------------------------------------│\n" +
                        "│\t\t회원이라면, 로그인 해주세요.\t\t\t\t\t│\n" +
                        "│\t\t2. 로그인\t\t\t\t\t\t\t\t│\n" +
                        "└-----------------------------------------------┘");
    }

    /////////////////////////// 회원가입 출력 포맷 //////////////////////////////
    public void SignUpStartAnnouncement() {
        System.out.println("------------------------------------------------------------------\n");
        System.out.println("                 아래 정보를 '#' 단위로 입력해주세요.");
        System.out.println("유저이름(30자 이내), 비밀번호(15자 이내), 학과(학부), 연락처(000-000-0000)");
    }
    public void SignUpEndAnnouncement() {
        System.out.println("                           회원가입 성공 !");
        System.out.println("------------------------------------------------------------------\n");
    }

    public void LoginStartAnnouncement() {
        System.out.println("------------------------------------------------------------------\n");
        System.out.println("               유저이름과 비밀번호를 입력해주세요.                        ");
    }

    public void LoginEndAnnouncement() {
        System.out.println("                         로그인 성공!                                 ");
        System.out.println("------------------------------------------------------------------\n");
    }


    /////////////////////////// 기능선택 출력 포맷 //////////////////////////////

    public void FunctionSelect(){
        System.out.println(
                        "┌----┬------------------------------------------┐\n" +
                        "│ NO │\t\t\t\t\t기능\t\t\t            │\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 1  │  profile();\t\t\t\t\t\t\t\t│\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 2  │  menu();\t\t\t\t\t\t\t\t\t│\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 3  │  order();\t\t\t\t\t\t\t\t│\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 4  │  myOrder();\t\t\t\t\t\t\t\t│\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 5  │  review();\t\t\t\t\t\t\t\t│\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 6  │  종료하기\t\t\t\t\t\t\t\t\t│\n" +
                        "└----┴------------------------------------------┘");
    }

    /////////////////////////// 프로그램 종료 출력 포맷 //////////////////////////////
    public void ProgramExitAnnouncement() {
        System.out.println("------------------------------------------------------------------\n");
        System.out.println("                         다음에 또 만나요 !                            ");
    }

    /////////////////////////// 회원정보 조회 출력 포맷 //////////////////////////////
    public void ProfileAnnouncement(
            int User_ID,
            String User_Name,
            String Dname,
            String Password,
            String Phone_Number,
            String Membership_Tier
    ){
        String OutPut = String.format(
                        "┌-----------------------------------------------┐\n" +
                        "│                  내 정보 확인                   │\n" +
                        "│----┬------------------------------------------│\n" +
                        "│ 1  │  유저번호 : %d\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 2  │  유저이름 : %s \n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 3  │  학과 : %s\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 4  │  비밀번호 : %s\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 5  │  연락처 : %s\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 6  │  멤버십 등급 : %s\n" +
                        "└----┴------------------------------------------┘"
                , User_ID, User_Name, Dname, Password, Phone_Number, Membership_Tier);
        System.out.println(OutPut);
    }


    /////////////////////////// 메뉴관련 출력 포맷 //////////////////////////////
    public void menuAnnouncement(){
        System.out.println(
                        "┌----┬------------------------------------------┐\n" +
                        "│ NO │\t\t\t\t\t기능\t\t\t            │\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 1  │  내 학과 전체 제휴업체 메뉴\t\t\t\t\t│\n" +
                        "│----┼------------------------------------------│\n" +
                        "│ 2  │  내 주소에 있는 학과 제휴업체 메뉴\t\t\t\t│\n" +
                        "└----┴------------------------------------------┘");
    }


    /////////////////////////// 내 학과 전체 제휴업체 메뉴 출력 포맷 //////////////////////////////
    public void All_AffiliatesStartAnnouncement(){
        System.out.print(
                "┌-----------------------------------------------┐\n" +
                "│       \t 내 학과 전체 제휴업체 메뉴\t            │\n");

    }

    public void All_AffiliatesAnnouncement(
            int Menu_ID,
            int Store_ID,
            String Mname,
            String Description,
            String Image
    ){
        String OutPut = String.format(
                        "│----┬------------------------------------------│\n" +
                        "│    │  메뉴ID : %d\n" +
                        "│----┼------------------------------------------│\n" +
                        "│    │  제휴가게ID : %s \n" +
                        "│----┼------------------------------------------│\n" +
                        "│    │  메뉴이름 : %s\n" +
                        "│----┼------------------------------------------│\n" +
                        "│    │  메뉴설명 : %s\n" +
                        "│----┼------------------------------------------│\n" +
                        "│    │  이미지 : %s\n" +
                        "│----┴------------------------------------------│\n"

                , Menu_ID, Store_ID, Mname, Description, Image);
        System.out.print(OutPut);
    }

    public void All_AffiliatesEndAnnouncement(){
        System.out.println(
                "└-----------------------------------------------┘");
    }

}
